app/views/users/show.html.erb


<% user = User.find_by(:id => params[:user_id]) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1


<% prf_category = Category.find_by(:id => user[:prf_category_id]) %>
<% prf_category_name = prf_category.name %>
<% prf_product = Product.find_by(:id => user[:prf_product_id]) %>
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = 1 LIMIT 1
SELECT "products".* FROM "products" WHERE "products"."id" = 2 LIMIT 1