app/controllers/deals_controller.rb

  def new
    deal = Deal.new
    deal.name = params["name"]
    deal.description = params["description"]
    deal.product = params["product"]
    deal.category = params["category"]
    deal.likes = params["likes"]
    deal.dislikes = params["dislikes"]
    deal.original_price = params["original_price"]
    deal.deal_price = params["deal_price"]
    deal.save
---
INSERT INTO "deals" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Wed, 05 Mar 2014 20:50:22 UTC +00:00], ["updated_at", Wed, 05 Mar 2014 20:50:22 UTC +00:00]]