app/controllers/deals_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."name" = 'Tablet' LIMIT 1
SELECT "deals".* FROM "deals" WHERE "deals"."category_id" = 4 ORDER BY updated_at desc
SELECT "deals".* FROM "deals" WHERE "deals"."category_id" = 1 ORDER BY id desc, updated_at desc LIMIT 3
SELECT "deals".* FROM "deals" ORDER BY id desc, updated_at desc LIMIT 6
---
  def index
    if params[:cat].present?
      filter_category = Category.find_by(:name => params[:cat])
      @deal_list = Deal.all.where(:category_id => filter_category.id)
      @deal_list = @deal_list.order('updated_at desc')
      redirect_to "/deals/:cat/category_list"
    else
      @deal_list = Deal.all.order('updated_at desc')
      @deal_list = @deal_list.limit(3)
    end

      @deal_list = @deal_list.order('updated_at desc')

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
---
  def new
    user = User.find_by(:id => session[:user_id])

INSERT INTO "deals" ("created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 05 Mar 2014 21:05:04 UTC +00:00], ["description", ""], ["name", ""], ["updated_at", Wed, 05 Mar 2014 21:05:04 UTC +00:00]]
---
  def create
    deal = Deal.new
    deal.name = params["name"]
    deal.description = params["description"]
    deal.product_id = params["product_id"]
    # deal.likes = params["likes"]
    # deal.dislikes = params["dislikes"]
    deal.original_price = params["original_price"]
    deal.deal_price = params["deal_price"]
    deal.save