app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "first_name", "last_name", "password", "prf_category_id", "prf_product_id", "updated_at", "zipcode") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    user = User.new
    user.first_name = params["first_name"]
    user.last_name = params["last_name"]
    user.email = params["email"]
    user.password = params["password"]
    user.zipcode = params["zipcode"]
    user.prf_category_id = params["prf_category_id"]
    user.prf_product_id = params["prf_product_id"]
    user.save